Revit 2027 API
STEPImportOptions(STEPImportOptions) Constructor
 Constructs a new instance of STEPImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public STEPImportOptions(
	STEPImportOptions option
)
Public Sub New (
	option As STEPImportOptions
)
public:
STEPImportOptions(
	STEPImportOptions^ option
)
new :
        option : STEPImportOptions -> STEPImportOptions
Parameters
option STEPImportOptions
 The STEP options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
STEPImportOptions Class
STEPImportOptions Overload
Autodesk.Revit.DB Namespace